FGMFoam-Delft/FGSFoam/03_testcase/constant/PVtableProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      tableProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mixtureFractionDefinition "readFromTable";

interpolationType       PVlinearInterpolation;

operatingPressure       1e5;

tablePath	"./../02_table/";


Z_param
51
(
 0.00000e+00
 2.00000e-02
 4.00000e-02
 6.00000e-02
 8.00000e-02
 1.00000e-01
 1.20000e-01
 1.40000e-01
 1.60000e-01
 1.80000e-01
 2.00000e-01
 2.20000e-01
 2.40000e-01
 2.60000e-01
 2.80000e-01
 3.00000e-01
 3.20000e-01
 3.40000e-01
 3.60000e-01
 3.80000e-01
 4.00000e-01
 4.20000e-01
 4.40000e-01
 4.60000e-01
 4.80000e-01
 5.00000e-01
 5.20000e-01
 5.40000e-01
 5.60000e-01
 5.80000e-01
 6.00000e-01
 6.20000e-01
 6.40000e-01
 6.60000e-01
 6.80000e-01
 7.00000e-01
 7.20000e-01
 7.40000e-01
 7.60000e-01
 7.80000e-01
 8.00000e-01
 8.20000e-01
 8.40000e-01
 8.60000e-01
 8.80000e-01
 9.00000e-01
 9.20000e-01
 9.40000e-01
 9.60000e-01
 9.80000e-01
 1.00000e+00
);

// ************************************************************************* //
